package com.woshidaniu.designpattern.solid;

/**
 * Created by kang on 2018/7/5.
 */
//开-闭原则（六大原则中绝对的大姐大，另外五姐妹心甘情愿臣服）：最后一个原则，一句话，对修改关闭，对扩展开放。
// 就是说我任何的改变都不需要修改原有的代码，而只需要加入一些新的实现，就可以达到我的目的，这是系统设计的理想境界，但是没有任何一个系统可以做到这一点，哪怕我一直最欣赏的spring框架也做不到，虽说它的扩展性已经强到变态。
//
//         这个原则更像是前五个原则的总纲，前五个原则就是围着它转的，只要我们尽量的遵守前五个原则，那么设计出来的系统应该就比较符合开闭原则了，相反，如果你违背了太多，那么你的系统或许也不太遵循开闭原则。
//
//
//
//         在《大话设计模式》一书中，提到一句话与各位共勉，我觉得很有说服力，即用抽象构建框架，用细节实现扩展。
//
//         以上六个原则写出来是为了指导后面设计模式的描述，基本都是我自己体会出来的理解，或许当中有好有坏，有优有差，各位不需要太过在意形式的表述，完全可以有自己的理解。



public class 开闭原则 {
}
